---
kind: method
id: M:Autodesk.Revit.DB.CitySetIterator.#ctor
source: html/75ae60e9-2efa-3103-0ad4-100841a7e13f.htm
---
# Autodesk.Revit.DB.CitySetIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public CitySetIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.